In [350]:
#Load Dependencies
import os
from os import path
import pandas as pd
import csv

In [351]:
purchase_data = "Resources/purchase_data.csv"

In [352]:
purchase_data_df = pd.read_csv(purchase_data, encoding="ISO-8859-1")

In [353]:
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [354]:
purchase_data_df = purchase_data_df.rename (columns={"SN":"Screen Name"})

In [355]:
bins = [0, 9, 14, 19, 24, 29,34,39,100]
age_groups = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39","40+"]

In [356]:
purchase_data_df["Age Group"] = pd.cut(purchase_data_df["Age"], bins, labels=age_groups, include_lowest=True)

In [357]:
purchase_data_df.head()

,Purchase ID,Screen Name,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [358]:
player_count = len(purchase_data_df["Screen Name"].unique())

In [359]:
player_summary_df = pd.DataFrame({"Total Unique Players": [player_count]})

In [360]:
player_summary_df

   Total Unique Players
0                   576

In [361]:
item_count = len(purchase_data_df["Item ID"].unique())

In [362]:
average_price = sum(purchase_data_df["Price"])/len(purchase_data_rename_df["Purchase ID"])

In [363]:
total_purchases = len(purchase_data_df["Purchase ID"])

In [364]:
total_revenue = sum(purchase_data_df["Price"])

In [365]:
purchase_summary_df = pd.DataFrame({"# of Unique Items": [item_count], 
                                   "Avg Price": average_price,
                                   "# of Purchases": total_purchases,
                                   "Total Revenue": total_revenue})

In [366]:
purchase_summary_df

   # of Unique Items  Avg Price  # of Purchases  Total Revenue
0                179   3.050987             780        2379.77

In [367]:
Gender_df = purchase_data_df[['Gender', 'Screen Name']].copy()
Gender_df = Gender_df.drop_duplicates()

In [368]:
Gender_df = Gender_df.groupby('Gender').count()

In [369]:
Gender_df.insert(1,"Percentage", Gender_df['Screen Name']/Gender_df['Screen Name'].sum())

In [370]:
Gender_df = Gender_df.rename (columns={"Screen Name":"Total Player Count"})

In [408]:
Gender_df.sort_values(by=['Percentage'], ascending=False, inplace=True)

In [409]:
GenderSales_df = purchase_data_df[['Gender', 'Screen Name']].copy()
GenderSales_df = GenderSales_df.set_index('Gender')
GenderSales_df = GenderSales_df.groupby('Gender').count()
GenderSales_df = GenderSales_df.rename (columns={"Screen Name":"Purchase Count"})
GenderSales_df

                       Purchase Count
Gender
Female                            113
Male                              652
Other / Non-Disclosed              15

In [373]:
GenderSales_df.insert(1,"Total Purchase Value", purchase_data_df.groupby('Gender').agg({'Price': ['sum']}))

In [374]:
GenderSales_df

                       Purchase Count  Total Purchase Value
Gender
Female                            113                361.94
Male                              652               1967.64
Other / Non-Disclosed              15                 50.19

In [375]:
GenderSales_df.insert(1,"Average Purchase Price (Gender)", GenderSales_df['Total Purchase Value']/GenderSales_df['Purchase Count'])

In [376]:
GenderSales_df

,Purchase Count,Average Purchase Price (Gender),Total Purchase Value
Gender,,,
Female,113,3.203009,361.94
Male,652,3.017853,1967.64
Other / Non-Disclosed,15,3.346000,50.19

In [377]:
GenderSales_df.insert(3,"Average Purchase Price (Player/Gender)", GenderSales_df['Total Purchase Value']/Gender_df['Total Player Count'])

In [378]:
GenderSales_df

,Purchase Count,Average Purchase Price (Gender),Total Purchase Value,Average Purchase Price (Player/Gender)
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [383]:
AgeGroups_df = purchase_data_df[['Age Group', 'Screen Name']].copy()
AgeGroups_df = AgeGroups_df.drop_duplicates()
AgeGroups_df = AgeGroups_df.groupby('Age Group').count()
AgeGroups_df = AgeGroups_df.rename (columns={"Screen Name":"Total Count"})

In [384]:
AgeGroups_df

           Total Count
Age Group
<10                 17
10-14               22
15-19              107
20-24              258
25-29               77
30-34               52
35-39               31
40+                 12

In [385]:
AgeGroups_df.insert(1,"Percentage of Players", AgeGroups_df['Total Count']/player_count)

In [386]:
AgeGroups_df

           Total Count  Percentage of Players
Age Group
<10                 17               0.029514
10-14               22               0.038194
15-19              107               0.185764
20-24              258               0.447917
25-29               77               0.133681
30-34               52               0.090278
35-39               31               0.053819
40+                 12               0.020833

In [387]:
AgeSales_df = purchase_data_df[['Age Group', 'Screen Name','Price']].copy()
AgeSales_df = AgeSales_df.set_index('Age Group')
AgeSales_df = AgeSales_df.groupby('Age Group').agg({'Screen Name': ['count'],'Price': ['sum']})
AgeSales_df.columns = AgeSales_df.columns.droplevel(1)
AgeSales_df = AgeSales_df.rename (columns={"Screen Name":"Purchase Count", "Price":"Total Purchase Value"})
AgeSales_df = AgeSales_df.rename_axis(None, axis=0)
AgeSales_df

       Purchase Count  Total Purchase Value
<10                23                 77.13
10-14              28                 82.78
15-19             136                412.89
20-24             365               1114.06
25-29             101                293.00
30-34              73                214.00
35-39              41                147.67
40+                13                 38.24

In [388]:
AgeSales_df

       Purchase Count  Total Purchase Value
<10                23                 77.13
10-14              28                 82.78
15-19             136                412.89
20-24             365               1114.06
25-29             101                293.00
30-34              73                214.00
35-39              41                147.67
40+                13                 38.24

In [389]:
AgeSales_df.insert(1,"Average Purchase Price (Age Group)", AgeSales_df['Total Purchase Value']/AgeSales_df['Purchase Count'])

In [390]:
AgeSales_df

,Purchase Count,Average Purchase Price (Age Group),Total Purchase Value
<10,23,3.353478,77.13
10-14,28,2.956429,82.78
15-19,136,3.035956,412.89
20-24,365,3.052219,1114.06
25-29,101,2.900990,293.00
30-34,73,2.931507,214.00
35-39,41,3.601707,147.67
40+,13,2.941538,38.24

In [391]:
AgeSales_df.insert(3,"Average Purchase Price (Player/Age Group)", AgeSales_df['Total Purchase Value']/AgeGroups_df['Total Count'])

In [397]:
AgeSales_df

       Screen Name  Average Purchase Price  Total Purchase Value
0          Lisim78                    3.53                  3.53
1      Lisovynya38                    1.56                  1.56
2       Ithergue48                    4.88                  4.88
3    Chamassasya86                    3.27                  3.27
4        Iskosia90                    1.44                  1.44
..             ...                     ...                   ...
775     Aethedru70                    3.54                  3.54
776         Iral74                    1.63                  1.63
777     Yathecal72                    3.46                  3.46
778        Sisur91                    4.19                  4.19
779      Ennrian78                    4.60                  4.60

[780 rows x 3 columns]

In [417]:
TopPurchase_df = purchase_data_df[['Purchase ID','Screen Name', 'Price','Price']].copy()
TopPurchase_df.columns = ['Purchase Count','Screen Name', 'Average Purchase Price', 'Total Purchase Value']
TopPurchase_df = TopPurchase_df.set_index('Screen Name')
TopPurchase_df = TopPurchase_df.groupby('Screen Name').agg({'Purchase Count': ['count'],'Average Purchase Price': ['mean'],'Total Purchase Value': ['sum']})
TopPurchase_df.columns = TopPurchase_df.columns.droplevel(1)
TopPurchase_df.sort_values(by=['Total Purchase Value'], ascending=False, inplace=True)

In [415]:
TopPurchase_df.head()

             Purchase Count  Average Purchase Price  Total Purchase Value
Screen Name
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

In [445]:
TopSalesPop_df = purchase_data_df[['Item ID','Item Name', 'Purchase ID','Price','Price']].copy()
TopSalesPop_df.columns = ['Item ID','Item Name', 'Sales Count', 'Average Sales Price', 'Total Sales Value']
TopSalesPop_df = TopSalesPop_df.set_index(['Item ID', 'Item Name'])
TopSalesPop_df = TopSalesPop_df.groupby(['Item ID', 'Item Name']).agg({'Sales Count': ['count'],'Average Sales Price': ['mean'],'Total Sales Value': ['sum']})
TopSalesPop_df.columns = TopSalesPop_df.columns.droplevel(1)
TopSalesPop_df.sort_values(by=['Sales Count'], ascending=False, inplace=True)

In [447]:
TopSalesPop_df

,,Sales Count,Average Sales Price,Total Sales Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
145,Fiery Glass Crusader,9,4.580000,41.22
132,Persuasion,9,3.221111,28.99
108,"Extraction, Quickblade Of Trembling Hands",9,3.530000,31.77
...,...,...,...,...
42,The Decapitator,1,1.750000,1.75
51,Endbringer,1,4.660000,4.66
118,"Ghost Reaver, Longsword of Magic",1,2.170000,2.17
104,Gladiator's Glaive,1,1.930000,1.93
91,Celeste,1,4.170000,4.17

In [439]:
TopSalesProf_df = TopSalesPop_df

In [440]:
TopSalesProf_df.sort_values(by=['Total Sales Value'], ascending=False, inplace=True)

In [450]:
TopSalesPop_df

,,Sales Count,Average Sales Price,Total Sales Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
145,Fiery Glass Crusader,9,4.580000,41.22
132,Persuasion,9,3.221111,28.99
108,"Extraction, Quickblade Of Trembling Hands",9,3.530000,31.77
...,...,...,...,...
42,The Decapitator,1,1.750000,1.75
51,Endbringer,1,4.660000,4.66
118,"Ghost Reaver, Longsword of Magic",1,2.170000,2.17
104,Gladiator's Glaive,1,1.930000,1.93
91,Celeste,1,4.170000,4.17